RETURN_MENU = 'Меню'
EDIT_RECORDS_ID = 'Введите ID записи, которую хотите редактировать:'
DELETE_RECORDS_ID = 'Введите ID записи, которую хотите удалить:'

ERROR_NUMBER = 'Необходимо вести положительное число'
ERROR_NUMBER_ID = 'Пожалуйста, введите действительный ID (целое число)'
ERROR_RECORDS_ID = 'Запись с таким ID не найдена'
ERROR_RECORD_EMPTY = 'Записей доходов/расходов нет'

HELP_MSG = '👋 Привет! Это Финансовый менеджер - ' \
           'ваш личный помощник для учета расходов.\n\n'\
           '📊 С помощью этого бота вы можете:\n'\
           '1. Вводить свои доходы, и расходы по категориям.\n'\
           '2. Получать графики ваших затрат, ' \
           'чтобы лучше контролировать свои финансы.\n\n'\
           '📝 Команды:\n'\
           '- /start - начать диалог с ботом.\n'\
           '- /help - получить помощь по использованию бота.\n\n'\
           '❗ Если у вас возникли проблемы или есть вопросы, ' \
           'не стесняйтесь писать @slavakyrlan. '\
           'Я всегда готов помочь вам!'
